import java.util.Arrays;

/**
 * Дан массив из 20 чисел. Определить сколько в нем пар одинаковых соседних элементов.
 * Например:
 * 1, 3,5,7,8,8, 10, 1
 * Количество одинаковых пар : 1
 * 8 8
 */
public class Main {
    public static void main(String[] args) {
//        int[] array = new int[]{1, 3, 5, 7, 8, 8, 10, 1};
//        int counter = 0;
//        for (int i = 0; i < array.length; i++) {
//            for (int j = i + 1; j < array.length - 1; j++) {
//                if (array[i] == array[j]) {
//                    counter++;
//                }
//            }
//        }
//
//        System.out.println( counter );
//
//    }

        /**
         * Дан массив из 25 чисел. Получить массив без повторяющихся элементов.
         * Например:
         * 33, 44,66,22, 54, 33, 76, 89, 90
         * 33, 44,66,22, 54, 76, 89, 90
         */

        int[] aza = new int[]{1, 2, 3, 4, 4, 5, 5, 9, 7, 8, 9, 20};
        for (int i = 0; i < aza.length; i++) {
            for (int j = 0; j < aza.length - 1; j++) {
                if (aza[i] >= aza[j]) {
                    System.out.println();

                }
            }


            //  public static void main1() {

        }
    }
}


/**
 * Дан массив из 25 чисел. Получить массив без повторяющихся элементов.
 * Например:
 * 33, 44,66,22, 54, 33, 76, 89, 90
 * 33, 44,66,22, 54, 76, 89, 90
 * <p>
 * Написать  метод, который в качестве параметра берёт два массива
 * с типом String.
 * Логика заключается в том, что  надо сравнить
 * все элементы на схожесть. Если все элементы идентичны,
 * тогда метод должен возвращать true, иначе false.
 * <p>
 * <p>
 * <p>
 * Метод жазыныз, ал метод бутун сан камтыган массивдин (размери 10) максималдуу
 * элементин жана минималдуу элементин таап, бири-бири менен орундарын алмаштырып койсун.
 * МИСАЛЫ:
 * int array = new int[]{16, 44, 200, 55, 3};
 * консолго:
 * 16, 44, 200, 55, 3
 * Масималдуу элементи: 200
 * Минималдуу элементи: 3
 * 16, 44, 3, 55, 200
 * (Не большая подсказка. Эки элементти бири-бири менен
 * алмаштыруу учун алардын индекстерин таап алуу керек болот).
 * <p>
 * <p>
 * Создорду кайтааруучу метод тузунуз, параметрине String типтеги массив алсын. Эгерде ал массивдин ичиндеги элемент так ортосунда "K" деген символду камтыса анда ал созду баш (чон) тамга менен алмаштырыныз.
 * МИСАЛЫ:
 * String array = new String[]{"hello", "world", "caKes"};
 * консолго:
 * оригинал массив:
 * hello, world, caKes
 * метод колдонулгандан кийинки массив
 * hello, world, CAKES
 * <p>
 * <p>
 * Консолдон бир соз же текст алыныз.
 * Тамгалардын массивин тузуп, ал массивдеги элементтердин (тамгалардын)
 * жардамы менен консолдон берилген созду курап чыгыныз.
 * Бирок тамганы массивдин ичинен рандомдун жардамы менен алыныз.
 * Сиз берген создун копиясын жана канча жолку аракетте созду же
 * тексти курап чыкты санын (количествосун ) консолго чыгарыныз.
 * МИСАЛЫ:
 * Озунуздун созунузду жазыныз, мен таап коройун:
 * мен бул текстти сизлерге тушундурмо катары жазып жатам
 * ----------------------------------------------------------------------------------------------------
 * Количество попыток: 1080457
 * Сиз жазган соз:
 * мен бул текстти сизлерге тушундурмо катары жазып жатам
 * static void sqrtMethod(int someNumber){
 * <p>
 * Math.sqrt() методу бизге санды тамырдан чыгарып берет,
 * биз ошол методдун реализациясын кол менен(ручной) жазып чыгышыбыз керек.
 * <p>
 * <p>
 * Негизи жылдар 12 жаныбардын аты менен аталып келет.
 * Коён, жылан, ит жана башка.
 * Тапшырма: Консолдон каалаган жылды жазсаныз, ошол жылы кайсы  жаныбардын жылы болгон чыгарып бериши керек.
 * Мисалы:
 * 2002 -> жылкы
 * 1982 ->  ит
 * <p>
 * <p>
 * Уч бурчтук деген класс тузунуз.
 * <p>
 * Класстын 3 полеси болсун a, b, c.
 * <p>
 * Класстын "area" деген методу болсун.
 * <p>
 * "area" методу полелериндеги маалыматтарга(маалымат объектти тузгондон кийин берилет)
 * <p>
 * таянып консолго уч бурчтуктун аянтын чыгарсын.
 */




/**
 *Написать  метод, который в качестве параметра берёт два массива
 * с типом String.
 * Логика заключается в том, что  надо сравнить
 * все элементы на схожесть. Если все элементы идентичны,
 * тогда метод должен возвращать true, иначе false.
 */


/**
 *Метод жазыныз, ал метод бутун сан камтыган массивдин (размери 10) максималдуу
 *  элементин жана минималдуу элементин таап, бири-бири менен орундарын алмаштырып койсун.
 * МИСАЛЫ:
 *         int array = new int[]{16, 44, 200, 55, 3};
 * консолго:
 *         16, 44, 200, 55, 3
 *         Масималдуу элементи: 200
 *         Минималдуу элементи: 3
 *         16, 44, 3, 55, 200
 * (Не большая подсказка. Эки элементти бири-бири менен
 * алмаштыруу учун алардын индекстерин таап алуу керек болот).
 *
 */


/**
 *Создорду кайтааруучу метод тузунуз, параметрине String типтеги массив алсын. Эгерде ал массивдин ичиндеги элемент так ортосунда "K" деген символду камтыса анда ал созду баш (чон) тамга менен алмаштырыныз.
 * МИСАЛЫ:
 *       String array = new String[]{"hello", "world", "caKes"};
 * консолго:
 *    оригинал массив:
 *       hello, world, caKes
 * метод колдонулгандан кийинки массив
 *       hello, world, CAKES
 *
 */


/**
 *Консолдон бир соз же текст алыныз.
 * Тамгалардын массивин тузуп, ал массивдеги элементтердин (тамгалардын)
 * жардамы менен консолдон берилген созду курап чыгыныз.
 * Бирок тамганы массивдин ичинен рандомдун жардамы менен алыныз.
 * Сиз берген создун копиясын жана канча жолку аракетте созду же
 * тексти курап чыкты санын (количествосун ) консолго чыгарыныз.
 * МИСАЛЫ:
 * Озунуздун созунузду жазыныз, мен таап коройун:
 * мен бул текстти сизлерге тушундурмо катары жазып жатам
 * ----------------------------------------------------------------------------------------------------
 * Количество попыток: 1080457
 * Сиз жазган соз:
 * мен бул текстти сизлерге тушундурмо катары жазып жатам
 *static void sqrtMethod(int someNumber){
 */


/**
 *Math.sqrt() методу бизге санды тамырдан чыгарып берет,
 *  биз ошол методдун реализациясын кол менен(ручной) жазып чыгышыбыз керек.
 *
 */


/**
 *Негизи жылдар 12 жаныбардын аты менен аталып келет.
 * Коён, жылан, ит жана башка.
 * Тапшырма: Консолдон каалаган жылды жазсаныз, ошол жылы кайсы  жаныбардын жылы болгон чыгарып бериши керек.
 * Мисалы:
 * 2002 -> жылкы
 * 1982 ->  ит
 *
 */


/**
 *Уч бурчтук деген класс тузунуз.
 *
 * Класстын 3 полеси болсун a, b, c.
 *
 * Класстын "area" деген методу болсун.
 *
 * "area" методу полелериндеги маалыматтарга(маалымат объектти тузгондон кийин берилет)
 *
 * таянып консолго уч бурчтуктун аянтын чыгарсын.
 */

/**
 *
 *
 */